app/controllers/admin/book_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`deleted_at` IS NULL AND (name like '%%') ORDER BY `books`.`name` ASC LIMIT 10 OFFSET 0
---
  def index
    @books = Book.where("name like ?", "%#{params[:search]}%").order(:name).page params[:page]

SELECT `types`.* FROM `types` WHERE `types`.`deleted_at` IS NULL
SELECT `locations`.* FROM `locations` WHERE `locations`.`deleted_at` IS NULL
SELECT `genres`.* FROM `genres` WHERE `genres`.`deleted_at` IS NULL
---
  def add
    @book = Book.new
    @type = Type.all.map { |type| [type.name, type.id] }
    @location = Location.all.map { |type| [type.name, type.id] }
    @genre = Genre.all.map { |type| [type.name, type.id] }

INSERT INTO `books` (`location_id`, `type_id`, `name`, `description`, `release_date`, `page_total`, `publisher`, `writer`, `bookphoto`, `book_total`, `book_total_remaining`, `deleted_at`, `created_at`, `updated_at`) VALUES (1, 1, 'harry potter', '<p>test novel 123456</p><p>&nbsp;</p>', '2022-08-08', 1000, 'test', 'test penulis', '_MG_8028.JPG', 100, 100, NULL, '2022-08-08 06:13:26.959664', '2022-08-08 06:13:26.959664')
SELECT `genres`.* FROM `genres` WHERE `genres`.`deleted_at` IS NULL
INSERT INTO `book_categories` (`book_id`, `genre_id`, `deleted_at`, `created_at`, `updated_at`) VALUES (4, 4, NULL, '2022-08-08 03:34:34.029559', '2022-08-08 03:34:34.029559')
SELECT `types`.* FROM `types` WHERE `types`.`deleted_at` IS NULL
SELECT `locations`.* FROM `locations` WHERE `locations`.`deleted_at` IS NULL
---
  def store
    params[:book][:book_total_remaining] = params[:book][:book_total]
    @book = Book.new(book_params)
    if @book.save
      params[:book][:genre].each do |i|
        if i != ""
          params[:book_id] = @book.id
          params[:genre_id] = i
          bookcategories = BookCategory.new(book_category_params)
          bookcategories.save
        end
      end
      redirect_to admin_book_index_path, flash: { :message => "Menambah Buku Berhasil", :type => "success" }
    else
      @type = Type.all.map { |type| [type.name, type.id] }
      @location = Location.all.map { |type| [type.name, type.id] }

SELECT `books`.* FROM `books` WHERE `books`.`deleted_at` IS NULL AND `books`.`id` = 2 LIMIT 1
SELECT `types`.* FROM `types` WHERE `types`.`deleted_at` IS NULL
SELECT `locations`.* FROM `locations` WHERE `locations`.`deleted_at` IS NULL
SELECT `genres`.* FROM `genres` WHERE `genres`.`deleted_at` IS NULL
---
  def edit
    @book = Book.find(params[:id]) rescue nil
    if @book.nil?
      redirect_to admin_book_index_path, flash: { :message => "Data Tidak ditemukan", :type => "warning" }
    end
    @book.bookphoto.cache!
    @type = Type.all.map { |type| [type.name, type.id] }
    @location = Location.all.map { |type| [type.name, type.id] }
    @genre = Genre.all.map { |type| [type.name, type.id] }

SELECT `books`.* FROM `books` WHERE `books`.`deleted_at` IS NULL AND `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `books`.`location_id` = 1, `books`.`description` = '<p>test namain yah</p>', `books`.`updated_at` = '2022-08-08 07:32:36.960276' WHERE `books`.`id` = 1
SELECT `book_categories`.* FROM `book_categories` WHERE `book_categories`.`deleted_at` IS NULL AND `book_categories`.`book_id` = 1
INSERT INTO `book_categories` (`book_id`, `genre_id`, `deleted_at`, `created_at`, `updated_at`) VALUES (1, 2, NULL, '2022-08-08 07:32:37.064534', '2022-08-08 07:32:37.064534')
---
  def update
    @book = Book.find(params[:id]) rescue nil
    if @book.nil?
      redirect_to admin_book_index_path, flash: { :message => "Data Tidak ditemukan", :type => "warning" }
    end

    if @book.update(book_params)
      BookCategory.where(:book_id => params[:id]).destroy_all
      params[:book][:genre].each do |i|
        if i != ""
          params[:book_id] = params[:id]
          params[:genre_id] = i
          bookcategories = BookCategory.new(book_category_params)
          bookcategories.save

SELECT `books`.* FROM `books` WHERE `books`.`deleted_at` IS NULL AND `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `books`.`deleted_at` = '2022-08-08 06:23:39', `books`.`updated_at` = '2022-08-08 06:23:39.971249' WHERE `books`.`id` = 2
SELECT `book_categories`.* FROM `book_categories` WHERE `book_categories`.`deleted_at` IS NULL AND `book_categories`.`book_id` = 4
---
  def destroy
    @book = Book.find(params[:id]) rescue nil
    if !@book.nil?
      @book.remove_bookphoto!
      @book.save
      @book.destroy
      BookCategory.where(:book_id => params[:id]).destroy_all