app/controllers/admin/borrower_controller.rb

  def index
    @borrowers = Borrower.page params[:page]
---
SELECT `borrowers`.* FROM `borrowers` WHERE `borrowers`.`deleted_at` IS NULL LIMIT 10 OFFSET 0

  def add
    @borrower = Borrower.new
    @books = Book.all.map { |type| [type.name, type.id] }
    @members = Member.all.map { |type| [type.name, type.id] }
---
SELECT `books`.* FROM `books` WHERE `books`.`deleted_at` IS NULL
SELECT `members`.* FROM `members` WHERE `members`.`deleted_at` IS NULL

  def store
    @Book = Book.where(:id => params[:borrower][:book_id]).first
    if @Book["book_total_remaining"] >= 1
      @book = Borrower.new(borrower_params)
      if @book.save
        booktotal = @Book["book_total_remaining"] - 1
        Book.where(:id => params[:borrower][:book_id]).update(:book_total_remaining => booktotal)
---
SELECT `books`.* FROM `books` WHERE `books`.`deleted_at` IS NULL AND `books`.`id` = 1 ORDER BY `books`.`id` ASC LIMIT 1
INSERT INTO `borrowers` (`book_id`, `member_id`, `deleted_at`, `statuspengembalian`, `created_at`, `updated_at`) VALUES (1, 1, NULL, 'Belum Dikembalikan', '2022-08-09 04:43:22.812591', '2022-08-09 04:43:22.812591')
SELECT `books`.* FROM `books` WHERE `books`.`deleted_at` IS NULL AND `books`.`id` = 1
UPDATE `books` SET `books`.`book_total_remaining` = 99, `books`.`updated_at` = '2022-08-08 09:30:27.454015' WHERE `books`.`id` = 1

  def return
    @Borrower = Borrower.find(params[:id]) rescue nil
    if !@Borrower.nil?
      @Book = Book.where(:id => @Borrower[:book_id]).first
      booktotal = @Book["book_total_remaining"] + 1
      Book.where(:id => @Borrower[:book_id]).update(:book_total_remaining => booktotal)
      Borrower.where(:id => @Borrower[:id]).update(:statuspengembalian => "Sudah Dikembalikan")
---
SELECT `borrowers`.* FROM `borrowers` WHERE `borrowers`.`deleted_at` IS NULL AND `borrowers`.`id` = 1 LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`deleted_at` IS NULL AND `books`.`id` = 1 ORDER BY `books`.`id` ASC LIMIT 1
UPDATE `borrowers` SET `borrowers`.`statuspengembalian` = 'Sudah Dikembalikan', `borrowers`.`updated_at` = '2022-08-09 04:45:29.154343' WHERE `borrowers`.`id` = 1
SELECT `books`.* FROM `books` WHERE `books`.`deleted_at` IS NULL AND `books`.`id` = 1
UPDATE `books` SET `books`.`book_total_remaining` = 99, `books`.`updated_at` = '2022-08-09 04:16:45.601734' WHERE `books`.`id` = 1
SELECT `borrowers`.* FROM `borrowers` WHERE `borrowers`.`deleted_at` IS NULL AND `borrowers`.`id` = 1