app/controllers/admin/genre_controller.rb

SELECT COUNT(*) FROM `genres` WHERE `genres`.`deleted_at` IS NULL AND (name like '%%')
SELECT `genres`.* FROM `genres` WHERE `genres`.`deleted_at` IS NULL AND (name like '%test%') ORDER BY `genres`.`name` ASC LIMIT 10 OFFSET 0
---
  def index
    @genres = Genre.where("name like ?", "%#{params[:search]}%").order(:name).page params[:page]

INSERT INTO `genres` (`name`, `deleted_at`, `created_at`, `updated_at`) VALUES ('action', NULL, '2022-07-21 03:56:42.442679', '2022-07-21 03:56:42.442679')
---
  def store
    @genre = Genre.new(genre_params)
    if @genre.save

SELECT `genres`.* FROM `genres` WHERE `genres`.`deleted_at` IS NULL AND `genres`.`id` = 3 LIMIT 1
---
  def edit
    @genre = Genre.find(params[:id]) rescue nil

SELECT `genres`.* FROM `genres` WHERE `genres`.`deleted_at` IS NULL AND `genres`.`id` = 4 LIMIT 1
UPDATE `genres` SET `genres`.`name` = 'Action', `genres`.`updated_at` = '2022-07-21 06:50:27.816074' WHERE `genres`.`id` = 4
---
  def update
    @genre = Genre.find(params[:id]) rescue nil
    if @genre.nil?
      redirect_to admin_genre_index_path, flash: { :message => "Data Tidak ditemukan", :type => "warning" }
    end

    if @genre.update(genre_params)

SELECT `genres`.* FROM `genres` WHERE `genres`.`deleted_at` IS NULL AND `genres`.`id` = 3 LIMIT 1
DELETE FROM `genres` WHERE `genres`.`id` = 3
---
  def destroy
    @genre = Genre.find(params[:id]) rescue nil
    if !@genre.nil?
      @genre.destroy