app/controllers/admin/genre_controller.rb

SELECT COUNT(*) FROM `genres`
SELECT `genres`.* FROM `genres` ORDER BY `genres`.`name` ASC LIMIT 25 OFFSET 0
---
  def index
    @genres = Genre.order(:name).page params[:page]

DELETE FROM `genres` WHERE `genres`.`id` = 3
---
  def destroy
    @genre = Genre.find(params[:id])
    @genre.destroy