app/controllers/admin/lokasi_controller.rb

  def index
    @locations = Location.where("name like ?", "%#{params[:search]}%").order(:name).page params[:page]
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`deleted_at` IS NULL AND (name like '%%') ORDER BY `locations`.`name` ASC LIMIT 10 OFFSET 0

  def store
    @location = Location.new(location_params)
    if @location.save
---
INSERT INTO `locations` (`name`, `deleted_at`, `created_at`, `updated_at`) VALUES ('Gedung B lantai 4 bracket 2', NULL, '2022-07-21 07:27:01.301027', '2022-07-21 07:27:01.301027')

  def edit
    @location = Location.find(params[:id]) rescue nil
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`deleted_at` IS NULL AND `locations`.`id` = 3 LIMIT 1

  def update
    @location = Location.find(params[:id]) rescue nil
    if @location.nil?
      redirect_to admin_location_index_path, flash: { :message => "Data Tidak ditemukan", :type => "warning" }
    end

    if @location.update(location_params)
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`deleted_at` IS NULL AND `locations`.`id` = 2 LIMIT 1
UPDATE `locations` SET `locations`.`name` = 'Gedung B lantai 4 bracket 3', `locations`.`updated_at` = '2022-07-21 07:41:59.390290' WHERE `locations`.`id` = 2

  def destroy
    @location = Location.find(params[:id]) rescue nil
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`deleted_at` IS NULL AND `locations`.`id` = 3 LIMIT 1