app/controllers/admin/member_controller.rb

  def index
    @members = Member.where("name like ?", "%#{params[:search]}%").order(:name).page params[:page]
---
SELECT `members`.* FROM `members` WHERE `members`.`deleted_at` IS NULL AND (name like '%%') ORDER BY `members`.`name` ASC LIMIT 10 OFFSET 0

  def store
    @member = Member.new(member_params)
    if @member.save
---
INSERT INTO `members` (`nik`, `name`, `email`, `phone`, `place_birth`, `date_birth`, `blood_type`, `gender`, `religion`, `photo`, `photo_path`, `address`, `deleted_at`, `created_at`, `updated_at`) VALUES ('125371247', 'Muhamamd Taufik Zamaludin', 'taufikmuhammad550@gmail.com', '089613872635', NULL, NULL, NULL, 'Laki -laki', NULL, 'IMG_7929.JPG', NULL, '<p>komplek bumi nyileuk</p>', NULL, '2022-07-22 08:05:33.510067', '2022-07-22 08:05:33.510067')

  def edit
    @member = Member.find(params[:id]) rescue nil
---
SELECT `members`.* FROM `members` WHERE `members`.`deleted_at` IS NULL AND `members`.`id` = 2 LIMIT 1

  def update
    @member = Member.find(params[:id]) rescue nil
    if @member.nil?
      redirect_to admin_member_index_path, flash: { :message => "Data Tidak ditemukan", :type => "warning" }
    end

    if @member.update(member_params)
---
SELECT `members`.* FROM `members` WHERE `members`.`deleted_at` IS NULL AND `members`.`id` = 1 LIMIT 1
UPDATE `members` SET `members`.`photo` = 'IMG_7964.JPG', `members`.`updated_at` = '2022-07-22 08:54:49.627931' WHERE `members`.`id` = 1

  def destroy
    @member = Member.find(params[:id]) rescue nil
    if !@member.nil?
      @member.remove_photo!
      @member.save
---
SELECT `members`.* FROM `members` WHERE `members`.`deleted_at` IS NULL AND `members`.`id` = 2 LIMIT 1
UPDATE `members` SET `members`.`deleted_at` = '2022-07-22 08:28:17', `members`.`updated_at` = '2022-07-22 08:28:17.668734' WHERE `members`.`id` = 2