app/controllers/admin/tipe_controller.rb

SELECT `types`.* FROM `types` WHERE `types`.`deleted_at` IS NULL AND (name like '%%') ORDER BY `types`.`name` ASC LIMIT 10 OFFSET 0
---
  def index
    @types = Type.where("name like ?", "%#{params[:search]}%").order(:name).page params[:page]

INSERT INTO `types` (`name`, `deleted_at`, `created_at`, `updated_at`) VALUES ('komik', NULL, '2022-07-21 07:59:07.007056', '2022-07-21 07:59:07.007056')
---
  def store
    @type = Type.new(type_params)
    if @type.save

SELECT `types`.* FROM `types` WHERE `types`.`deleted_at` IS NULL AND `types`.`id` = 3 LIMIT 1
---
  def edit
    @type = Type.find(params[:id]) rescue nil

SELECT `types`.* FROM `types` WHERE `types`.`deleted_at` IS NULL AND `types`.`id` = 3 LIMIT 1
UPDATE `types` SET `types`.`name` = 'novel', `types`.`updated_at` = '2022-07-21 08:01:01.630702' WHERE `types`.`id` = 3
---
  def update
    @type = Type.find(params[:id]) rescue nil
    if @type.nil?
      redirect_to admin_type_index_path, flash: { :message => "Data Tidak ditemukan", :type => "warning" }
    end

    if @type.update(type_params)

SELECT `types`.* FROM `types` WHERE `types`.`deleted_at` IS NULL AND `types`.`id` = 2 LIMIT 1
---
  def destroy
    @type = Type.find(params[:id]) rescue nil