app/commands/authenticate_user.rb

  def api_user
    user = User.find_by_email(email)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'admin@admin.com' LIMIT 1