app/controllers/login_controller.rb

  def store
    user = User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'admin@admin.com' LIMIT 1

  def forgotpassstore
    @user = User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'taufikmuhammad550@gmail.com' LIMIT 1

  def forgotpassupdate
    @user = User.find_signed!(params[:token], purpose: "resetpass")
    if @user.update(password_params)
---
UPDATE `users` SET `users`.`password_digest` = '$2a$12$JuT.j.c2A/ZYu7d5kcclZ.knrR2uURMjCZlloWQUI1yI1lHQwerAm', `users`.`updated_at` = '2022-07-20 03:04:08.134977' WHERE `users`.`id` = 1