app/views/admin/book/add.html.erb

SELECT `genres`.* FROM `genres` WHERE `genres`.`deleted_at` IS NULL
---
          <div class="form-group col-md-6">
            <% invalid = @book.errors.include?(:genre) %>