app/views/admin/book/edit.html.erb

</script>
<% @book.book_categories.each do |book_category| %>
---
SELECT `book_categories`.* FROM `book_categories` WHERE `book_categories`.`deleted_at` IS NULL AND `book_categories`.`book_id` = 1