app/views/admin/book/index.html.erb

SELECT `book_categories`.* FROM `book_categories` WHERE `book_categories`.`deleted_at` IS NULL AND `book_categories`.`book_id` = 3
---
                  <ul>
                    <% book.book_categories.each do |book_category| %>